In [15]:
import pandas as pd

In [5]:
data = {
    "cars": ["toyota", "honda", "mercedes"],
    "passings": [3, 7, 2],
    "colors": ["red", "black", "silver"],
}


var = pd.DataFrame(data)

var

       cars  passings  colors
0    toyota         3     red
1     honda         7   black
2  mercedes         2  silver

In [ ]:
data1 = {
    "server": {
        "host": "localhost",
        "port": 8080,
        "timeout": 30,
    },
    "users": [
        {"name": "Ali", "role": "admin"},
        {"name": "Sara", "role": "editor"},
    ],
    "features": {
        "logging": True,
        "debug": False,
    },
}

server_df = pd.DataFrame([data1["server"]])
features_df = pd.DataFrame([data1["features"]])
users_df = pd.DataFrame(data1["users"])

# server_df
# features_df
users_df

   name    role
0   Ali   admin
1  Sara  editor

In [25]:
a = [1, 7, 2, 232, 342, 2432, 23, 34, "hassam"]

var = pd.Series(a)

print(var)

0         1
1         7
2         2
3       232
4       342
5      2432
6        23
7        34
8    hassam
dtype: object

# Learning

### pd.series

In [31]:
a = pd.Series([21, 32, 5, 65])
a

0    21
1    32
2     5
3    65
dtype: int64

In [49]:
a.describe

<bound method NDFrame.describe of 0    21
1    32
2     5
3    65
dtype: int64>

### pd.Dataframe

In [16]:
data = {
    "Name" : ["Hassam", "Muneeb", "Asad"],
    "Age" : [24, 24, 22],
    "B-year" : [2001, 2001, 2003],
    "City": ["Mureedky", "Lahore", "Shadrah"]
}

df = pd.DataFrame(data)
df

     Name  Age  B-year      City
0  Hassam   24    2001  Mureedky
1  Muneeb   24    2001    Lahore
2    Asad   22    2003   Shadrah

In [ ]:
df.tail(2)#df.head(3) #df.dtypes #df.index # df.describe #df.info # df.shape

     Name  Age  B-year     City
1  Muneeb   24    2001   Lahore
2    Asad   22    2003  Shadrah

In [21]:
new_data = pd.DataFrame([
    {"Name": "Ali", "Age": 25, "B-year": 2000, "City": "Karachi"},
    {"Name": "Raza", "Age": 27, "B-year": 1998, "City": "Islamabad"}
])

df = pd.concat([df, new_data], ignore_index=True)

#### Indexing / Selecting / Subsetting Data

.loc[]

.iloc[]

.at

.iat

In [76]:
df = pd.DataFrame(data, index = ['a', 'b', 'c'])
df

     Name  Age  B-year      City
a  Hassam   24    2001  Mureedky
b  Muneeb   24    2001    Lahore
c    Asad   22    2003   Shadrah

In [ ]:
df.loc[["a", 'b', 'c']]

     Name  Age  B-year      City
a  Hassam   24    2001  Mureedky
b  Muneeb   24    2001    Lahore
c    Asad   22    2003   Shadrah

In [23]:
mask = df['Age'] > 22
df_filtered = df[(mask)] #& (df['City'] == 'Lahore')]

In [24]:
df_filtered

      Name  Age  B-year       City
0   Hassam   24    2001   Mureedky
1   Muneeb   24    2001     Lahore
3      Ali   25    2000    Karachi
4     Raza   27    1998  Islamabad
5      Ali   25    2000    Karachi
6     Raza   27    1998  Islamabad
7      Ali   25    2000    Karachi
8     Raza   27    1998  Islamabad
9      Ali   25    2000    Karachi
10    Raza   27    1998  Islamabad
11     Ali   25    2000    Karachi
12    Raza   27    1998  Islamabad

In [25]:
df[df["City"].isin(["Lahore", "Karachi"])]

      Name  Age  B-year     City
1   Muneeb   24    2001   Lahore
3      Ali   25    2000  Karachi
5      Ali   25    2000  Karachi
7      Ali   25    2000  Karachi
9      Ali   25    2000  Karachi
11     Ali   25    2000  Karachi

#### MultiIndex / hierarchical indexing

In [13]:
arrays = [
    ["A", "A", "B", "B", "C"],
    [1, 2, 3, 1, 2]
]

multi_index = pd.MultiIndex.from_arrays(arrays, names=("Group", "Number"))

df_multi = pd.DataFrame({"Value": [10, 20, 30, 40, 50]}, index=multi_index)
df_multi

              Value
Group Number
A     1          10
      2          20
B     3          30
      1          40
C     2          50

Fetching Many Values at Once by Vactorize operation


Below will triggers optimized block slicing.

In [30]:
# rows = [1, 3, 5]
# cols = ["age", "priority"]

# subset = df.loc[rows, cols]


rows = [2, 4, 8]
values = df["Age"].iloc[rows]

values

2    22
4    27
8    27
Name: Age, dtype: int64